---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures
source: html/58215557-7233-e3b7-f18e-b33219a69329.htm
---
# BuiltInFailures.ElementTypeFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.